print("Школа гриба, покрытая ... кожиц..й, держится на ... ножк.. . Снизу шляпка затянута ... плёнкой. Когда её уберёшь, откроется нижняя ... сторона шляпк.. .")

a = ("Школа гриба, покрытая... ")
b1 = input("покрытая ")

a = ('кожиц..й')
b2 = input('кожиц')

a = ("держится на ... ")
b3 = input('держится на ')

a = ('ножке..')
b4 = input('ножке')

a = ('затянута ...')
b5 = input('затянута ')

a = ('нижняя ...')
b6 = input('нижняя ')

a = ('шляпк..')
b7 = input('шляпк')

print(f'Школа гриба, покрытая {b1} {b2}, держится на {b3} {b4} . Снизу шляпка затянута {b5} плёнкой. Когда её уберёшь, откроется нижняя {b6} сторона {b7} .')